In [10]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('example_data.csv')
print(df.head())

print(df.tail())

    Name  Age  Gender      City
0   John   56  Female  New York
1  Alice   46  Female  New York
2  Alice   32    Male  New York
3    Bob   60    Male  New York
4   John   25    Male   Chicago
       Name  Age  Gender      City
95     Jane   24    Male   Chicago
96      Bob   26  Female   Houston
97     John   41  Female  New York
98     Jane   18    Male   Houston
99  Charlie   61  Female   Chicago

In [3]:
name_column = df['Name']
print(name_column)

subset_df = df[['Name', 'Age']]
print(subset_df)

0        John
1       Alice
2       Alice
3         Bob
4        John
       ...
95       Jane
96        Bob
97       John
98       Jane
99    Charlie
Name: Name, Length: 100, dtype: object
       Name  Age
0      John   56
1     Alice   46
2     Alice   32
3       Bob   60
4      John   25
..      ...  ...
95     Jane   24
96      Bob   26
97     John   41
98     Jane   18
99  Charlie   61

[100 rows x 2 columns]

In [4]:
sorted_df = df.sort_values(by='Age', ascending=False)
print(sorted_df)

df['New_Column'] = df['Age'] * 2
print(df)

df.drop('New_Column', axis=1, inplace=True)
print(df)

print(df.isnull().sum())

df_filled = df.fillna(0)
print(df_filled)

       Name  Age  Gender         City
84    Alice   64  Female     New York
34     John   64    Male  Los Angeles
55    Alice   64    Male      Chicago
51  Charlie   64    Male      Chicago
92      Bob   62  Female     New York
..      ...  ...     ...          ...
48    Alice   19    Male      Phoenix
17     John   19    Male      Chicago
22     John   19    Male  Los Angeles
93    Alice   18  Female      Chicago
98     Jane   18    Male      Houston

[100 rows x 4 columns]
       Name  Age  Gender      City  New_Column
0      John   56  Female  New York         112
1     Alice   46  Female  New York          92
2     Alice   32    Male  New York          64
3       Bob   60    Male  New York         120
4      John   25    Male   Chicago          50
..      ...  ...     ...       ...         ...
95     Jane   24    Male   Chicago          48
96      Bob   26  Female   Houston          52
97     John   41  Female  New York          82
98     Jane   18    Male   Houston          36
99  Charlie   61  Female   Chicago         122

[100 rows x 5 columns]
       Name  Age  Gender      City
0      John   56  Female  New York
1     Alice   46  Female  New York
2     Alice   32    Male  New York
3       Bob   60    Male  New York
4      John   25    Male   Chicago
..      ...  ...     ...       ...
95     Jane   24    Male   Chicago
96      Bob   26  Female   Houston
97     John   41  Female  New York
98     Jane   18    Male   Houston
99  Charlie   61  Female   Chicago

[100 rows x 4 columns]
Name      0
Age       0
Gender    0
City      0
dtype: int64
       Name  Age  Gender      City
0      John   56  Female  New York
1     Alice   46  Female  New York
2     Alice   32    Male  New York
3       Bob   60    Male  New York
4      John   25    Male   Chicago
..      ...  ...     ...       ...
95     Jane   24    Male   Chicago
96      Bob   26  Female   Houston
97     John   41  Female  New York
98     Jane   18    Male   Houston
99  Charlie   61  Female   Chicago

[100 rows x 4 columns]

In [5]:
unique_cities = df['City'].unique()
print(unique_cities)

city_counts = df['City'].value_counts()
print(city_counts)

young_people = df[df['Age'] < 30]
print(young_people)

['New York' 'Chicago' 'Houston' 'Phoenix' 'Los Angeles']
New York       31
Chicago        24
Houston        22
Los Angeles    14
Phoenix         9
Name: City, dtype: int64
       Name  Age  Gender         City
4      John   25    Male      Chicago
9      Jane   28    Male      Chicago
10     Jane   28    Male      Chicago
15     John   20    Male  Los Angeles
17     John   19    Male      Chicago
22     John   19    Male  Los Angeles
25      Bob   29    Male  Los Angeles
36    Alice   20    Male      Phoenix
38      Bob   24    Male     New York
40      Bob   26    Male  Los Angeles
43    Alice   21  Female  Los Angeles
46  Charlie   26  Female      Chicago
48    Alice   19    Male      Phoenix
52     John   24  Female     New York
54      Bob   25  Female      Houston
61      Bob   21  Female      Houston
62     Jane   19    Male      Chicago
63     John   23  Female  Los Angeles
65     Jane   21  Female      Chicago
71     Jane   27    Male     New York
76      Bob   25    Male  Los Angeles
93    Alice   18  Female      Chicago
95     Jane   24    Male      Chicago
96      Bob   26  Female      Houston
98     Jane   18    Male      Houston

In [6]:
df_reset_index = df.reset_index(drop=True)
print(df_reset_index)

df.rename(columns={'Age': 'Years'}, inplace=True)
print(df)

mean_age = df['Years'].mean()
print(mean_age)

name_counts = df['Name'].value_counts()
print(name_counts)

       Name  Age  Gender      City
0      John   56  Female  New York
1     Alice   46  Female  New York
2     Alice   32    Male  New York
3       Bob   60    Male  New York
4      John   25    Male   Chicago
..      ...  ...     ...       ...
95     Jane   24    Male   Chicago
96      Bob   26  Female   Houston
97     John   41  Female  New York
98     Jane   18    Male   Houston
99  Charlie   61  Female   Chicago

[100 rows x 4 columns]
       Name  Years  Gender      City
0      John     56  Female  New York
1     Alice     46  Female  New York
2     Alice     32    Male  New York
3       Bob     60    Male  New York
4      John     25    Male   Chicago
..      ...    ...     ...       ...
95     Jane     24    Male   Chicago
96      Bob     26  Female   Houston
97     John     41  Female  New York
98     Jane     18    Male   Houston
99  Charlie     61  Female   Chicago

[100 rows x 4 columns]
40.88
John       24
Bob        20
Alice      19
Jane       19
Charlie    18
Name: Name, dtype: int64

In [13]:
df.to_csv('modified_data.csv', index=False)